Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: གཞོན་ནུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྔོན་གྱི་མཐའ་དང་། ཕྱི་མའི་མཐའ་དང་ད་ལྟར་བྱུང་བ་ཤེས་པའི་གཏེར་རྙེད་པ་ཡིན་ནོ།
en: Young man, in that way bodhisattva mahāsattvas obtain the treasure of knowing the past, the future, and the present.

source: །གཞོན་ནུ་མདོར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟ་བུའི་ཆོས་ལ་གནས་པ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཐོབ་པར་འགྱུར་ཏེ།
en: “Young man, in brief, bodhisattva mahāsattvas who maintain the qualities of the Dharma in that way will obtain the entire Dharma of the buddhas.

source: དེ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ས་ཡང་མ་ཡིན་ན་ཕ་རོལ་རྒོལ་བ་ཐམས་ཅད་ལྟ་ཅི་སྨོས།
en: This level is not reached by śrāvakas or pratyekabuddhas, let alone any adversary of the Dharma.”

source: དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ།
en: On this topic, it was said:

source: མཁས་པ་རྟག་ཏུ་དགོན་གནས་ཏེ།
en: “The wise ones who remain in solitude

source: །སངས་རྒྱས་གཏེར་དང་ཆོས་ཀྱི་གཏེར།
en: Will quickly attain the treasure of the buddhas, The treasure of the Dharma, the treasure of wisdom,

source: །ཡེ་ཤེས་གཏེར་དང་སྔོན་མཐའི་གཏེར། །མངོན་ཤེས་ལྔ་ཡང་མྱུར་དུ་འཐོབ།
en: The treasure of the past, and the five higher cognitions.” {83}

source: །ཕན་ཡོན་བཅུའི་ལེའུ་སྟེ་ཉི་ཤུ་དགུ་པའོ།། །།
en: Conclusion of the twenty-ninth chapter, “Ten Benefits.” Tejaguṇarāja Chapter 30

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། གཞོན་ནུ་དེ་ལྟ་བས་ན་ལྷའི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་ཀྱི་བདེ་བ་ཡང་སྤངས་ཏེ་རབ་ཏུ་བྱུང་ངོ་ཞེས་གཞོན་ནུ་ཁྱོད་ཀྱིས་དེ་ལྟར་བསླབ་པར་བྱའོ།
en: Then the Bhagavān said to the youth Candraprabha, “Therefore, young man, you should train in this way, thinking, ‘I will abandon even the pleasures of the kingship of a divine cakravartin and enter homelessness.’

source: །གཞོན་ནུ་རབ་ཏུ་བྱུང་ནས་ཀྱང་སྦྱངས་པའི་ཡོན་ཏན་ཡོ་བྱད་བསྙུངས་པ་ལ་གནས་ཤིང་དབེན་པར་གནས་པ་དང་། བཟོད་པ་དང་དེས་པ་ཕུན་སུམ་ཚོགས་པར་བྱའོ། །གཞོན་ནུ་མགོ་དང་གོས་ལ་མེ་འབར་བ་བཞིན་དུ་བརྩོན་འགྲུས་བརྩམས་ཏེ་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་འདི་མཉན་པར་བྱ། གཟུང་བར་བྱ། ཀུན་ཆུབ་པར་བྱ། བཅང་བར་བྱ། བཀླག་པར་བྱ།
en: “Young man, having entered homelessness you should maintain the disciplines of mendicancy, live in solitude, and develop perfect mildness and patience.

source: རབ་ཏུ་གདོན་པར་བྱ། ལུང་མནོད་ཅིང་ཁ་ཏོན་དུ་བྱ། ཉོན་མོངས་པ་མེད་པའི་བསྒོམ་པས་བསྒོམ་པར་བྱ། མང་དུ་བྱ། གཞན་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱའོ།
en: “Young man, you should apply yourself diligently, as if your hair and clothes were on fire, and listen to the samādhi, the revealed equality of the nature of all phenomena, learn it, understand it, keep it, recite it to others, promote it, proclaim it, chant it, meditate on it with unadulterated meditation, promulgate it, and make it widely known to others.

source: །གཞོན་ནུ་བསེ་རུ་ལྟ་བུར་གྱུར་པས་གཉིས་སུ་མེད་པར་དགོན་པ་དང་ནགས་འདབ་ཏུ་རྟག་ཏུ་གནས་པར་བྱའོ། །གཞོན་ནུ་བདག་ཉིད་ཡོངས་སུ་གཏོང་བས་ཀྱང་སེམས་ཅན་དེ་དག་གི་དོན་བྱའོ།
en: “Young man, you should always, like a rhinoceros, dwell without a companion in the forest.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་དོན་དེ་ཉིད་བརྗོད་པའི་ཕྱིར། ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་སྔོན་བྱུང་བའི་ལེའུ་འདི་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཡང་དག་པར་རབ་ཏུ་བསྟན་ཏོ།
en: Thereupon the Bhagavān, in order to explain this topic, gave a detailed teaching on this episode from the past by chanting the following verses to the youth Candraprabha:

source: །འདས་པའི་བསྐལ་པ་བརྒྱ་མང་རབ་དྲན་ཏེ།
en: “I remember many hundreds of eons ago

source: །གྲགས་པ་མཐའ་ཡས་འདྲེན་པ་གང་བྱུང་བ།
en: There was a guide of limitless renown.

source: །ལྷ་མི་ཀླུ་ཡི་ཚོགས་ཀྱིས་མཆོད་པ་སྟེ།
en: Multitudes of humans, devas, and nāgas made offerings to him.

source: །མཚན་ནི་གཟི་བརྗིད་ཚོགས་རྒྱལ་རྒྱལ་བ་ཡིན།
en: He was a jina named Tejaguṇarāja. {1} “During that time there formed a community

source: །དགེ་སློང་བྱེ་བ་ཕྲག་བཅུ་དྲུག་མངོན་ཤེས།
en: Of a hundred and sixty million bhikṣus with higher cognitions,

source: །ཡང་དག་རིག་དང་དབང་གི་ཕ་རོལ་ཕྱིན།
en: Who had completely attained the power of the discernments,

source: །སྦྱངས་ཚུལ་ཡོ་བྱད་བསྙུངས་པ་ཞི་བའི་ཡིད།
en: Who practiced the austerity of the disciplines of mendicancy, and who had peaceful minds. {2}

source: །དེ་ཡི་དུས་ན་དེ་ཡི་ཚོགས་རྣམས་བྱུང་།
en: “At that time there were in this Jambudvīpa

source: །གྲོང་ཁྱེར་བྱེ་བ་བརྒྱ་ཕྲག་བདུན་ཅུ་དྲུག །དཔག་ཚད་ལྔ་ཡི་ཚད་དང་མཉམ་པ་སྟེ།
en: One billion seven hundred and sixty million towns, And each of them was five yojanas wide,

source: །རིན་ཆེན་སྣ་བདུན་བྱེ་བྲག་འཕགས་པའི་མཆོག །དེ་ཚེ་འཛམ་བུའི་གླིང་འདིར་བྱུང་བར་གྱུར།
en: And was particularly supreme, made of the seven precious materials. {3}

source: །དེ་ཚེ་གྲོང་མཆོག་དམ་པ་དེ་ཀུན་ཀྱང་།
en: “At that time, all of those perfect towns

source: །སྐྱེད་མོས་ཚལ་བརྒྱ་མང་པོས་རབ་ཏུ་བརྒྱན། །སྐྱེད་མོས་ཚལ་ཀུན་སྟུག་པའི་སྤྲིན་བཞིན་དུ། །མེ་ཏོག་འབྲས་བུས་བརྒྱན་ཅིང་ཤིང་རྣམས་རྒྱས།
en: Were adorned by many hundreds of parks, And all those parks were adorned With fresh flowers and fruit, like massed clouds. {4} “Those perfect parks were adorned With various beautiful trees with edible fruits— Covered with jackfruits, mangos, rose apples, and breadfruit,

source: །བཟའ་ཤིང་རིགས་ཀྱང་སྣ་ཚོགས་མཛེས་པ་དག །ལ་ཀུ་ཨ་མྲ་ཛམ་བུ་པ་ནས་དཀྲིགས། །ཀར་ནི་ཙམ་པ་པུར་ན་བརྒྱ་ཡིས་ཀྱང་། །སྐྱེད་མོས་ཚལ་མཆོག་དེ་དག་རབ་ཏུ་བརྒྱན།
en: And with hundreds of karnikara, magnolia, and puṇṇaga trees. {5}

source: །ནྱ་གྲོ་དྷ་ལས་བྱ་མང་སྒྲ་འབྱིན་ཏེ།
en: “At that time, flocks of birds in banyan trees would sing—

source: །ཁུ་བྱུག་ཀ་ལ་པིང་ཀ་རྨ་བྱ་བརྒྱ། །ཤང་ཤང་ཏེའུ་དང་ཀུ་ནལ་སྒྲ་འབྱིན་པ།
en: Hundreds of cuckoos, avadavats, and peacocks,

source: །བྱ་ཚོགས་མང་པོ་དེ་ཚེ་སྙན་པར་སྒྲོག །ངང་པའི་རྒྱལ་པོ་ངང་སྐྱ་འདྲ་བ་དང་། །བུང་བ་ཀུ་ནལ་སྒྲ་དབྱངས་མཆོག་སྒྲོག་སྟེ།
en: And flocks of many other birds were heard: The songs of parrots, partridges, and snipes. {6} “There was the supreme sound of the songs of bees and partridges That equaled that of Dhṛtarāṣṭra, the king of geese.

source: །ཡན་ལག་བཀྲ་ཞིང་ཚོན་ཆེ་ཁ་དོག་འབར།
en: They had bright, multicolored bodies, brilliant with great hues,

source: །ཤིན་ཏུ་ཡིད་འོང་སྒྲ་འཇམ་དགའ་བ་འབྱིན།
en: And sang delightful, beautiful, charming songs. {7}

source: །དེའི་དུས་བྱ་མང་དེ་དག་འདུས་གྱུར་ཏེ།
en: “At that time, there were gatherings of these birds, There were the songs of avadavats, peacocks, and parrots,

source: །ཀ་ལ་པིང་ཀ་རྨ་བྱ་ནེ་ཙོ་དང་། །ཁུ་བྱུག་རི་སྐེགས་བྱ་རྣམས་སྣ་ཚོགས་པ།
en: Cuckoos, mynas, and a variety of other birds—

source: །བྱ་མང་དེ་དག་སྣ་ཚོགས་སྒྲ་ཡང་འབྱིན།
en: Various kinds of songs from many birds. {8}

source: །སྐྱེད་མོས་ཚལ་བརྒྱ་དག་ན་དེ་དག་གནས།
en: “They dwelt in those hundreds of parks Where there were the blossoms of karnikara,

source: །བཏང་བཟུང་མྱ་ངན་འཚང་དང་བར་ཤ་ཀ།
en: Gardenia, aśoka, and kachnar trees,

source: །ཨ་ཏི་མུག་ཏ་མེ་ཏོག་འདབ་མ་དང་། །པད་མ་ཨུད་པལ་ཀུ་མུད་པད་མ་དཀར།
en: As well as red lotuses, blue lotuses, night lotuses, and white lotuses. {9}

source: །པད་མ་འདབ་སྟོང་བརྒྱ་ཡིས་རབ་ཏུ་བརྒྱན། །མེ་ཏོག་དེ་དག་རྫིང་བུ་མཛེས་པར་བྱེད།
en: “They were beautified by lotus flower ponds That were adorned by a hundred thousand lotuses. There were beautiful, exquisite lotus ponds

source: །དྲི་ཞིམ་སྤོས་མཆོག་དམ་པས་སོ་སོར་བརྒྱན། །རྫིང་བུ་སྡུག་ཅིང་ཤིན་ཏུ་མཛེས་པར་གྱུར།
en: Adorned by the fragrance of the most delightful scents. {10}

source: །དེ་ཚེ་འཛམ་བུའི་གླིང་འདིར་རྒྱལ་པོ་ནི།
en: “At that time, the king in this Jambudvīpa

source: །མི་དབང་བརྟན་པས་བྱིན་ཞེས་བྱ་བ་བྱུང་།
en: Was the lord of men whose name was Dṛdhadatta.

source: །དེ་ཡི་བུ་ཡང་བརྒྱ་ཕྲག་ལྔ་ཡོད་དེ།
en: He had five hundred sons

source: །བྱད་བཞིན་བཟང་ཞིང་ཤིན་ཏུ་བལྟ་ན་སྡུག །དེ་ཚེ་རྒྱལ་སྲིད་ཞི་ཞིང་བདེ་བར་གྱུར།
en: Who were handsome and beautiful to see. {11} “At that time the kingdom was peaceful and happy,

source: །གཙེ་བ་མེད་ཅིང་དབྱངས་དགའ་རྣལ་དུ་བབ།
en: Free of calamities, and filled with joy and peace.

source: །འཛམ་བུའི་གླིང་ཡང་མེ་ཏོག་མང་པོས་བརྒྱན།
en: Jambudvīpa was adorned by many flowers.

source: །ལྷ་ཡི་གནས་དང་མཚུངས་ཤིང་བྱེ་བྲག་མེད།
en: It was identical to a paradise, with no difference. {12}

source: །དེ་ཚེ་སྡིག་མེད་སྟོབས་བཅུ་ལྡན་པ་ཡི། །རྒྱལ་བ་དེ་ནི་ཏིང་འཛིན་མཆོག་འདི་འཆད།
en: “At that time there was a jina, one with the ten strengths, Without bad actions, who taught this supreme samādhi:

source: །སྲིད་པའི་འགྲོ་བ་རྨི་ལམ་ལྟ་བུ་སྟེ།
en: ‘The beings within existence are like dreams.

source: །འདི་ལ་སུ་ཡང་མི་སྐྱེ་འཆི་བ་མེད།
en: There is no one who is born and no one who dies. {13}

source: །སེམས་ཅན་མིང་དང་སྲོག་ཀྱང་མི་རྙེད་དེ།
en: “ ‘There is no being to be found, and no soul, or person.

source: །ཆོས་འདི་རྣམས་ནི་རྨི་ལམ་ཆུ་ཤིང་འདྲ།
en: These phenomena are like dreams or a plantain tree;

source: །སྒྱུ་མ་ལྟ་བུ་ནམ་མཁའི་གློག་འདྲ་སྟེ།
en: Like illusions, the same as lightning in the sky;

source: །ཆུ་ཡི་ཟླ་བ་འདྲ་ཞིང་སྨིག་རྒྱུ་བཞིན།
en: Like the moon on water, the same as a mirage. {14}

source: །མི་གང་འཇིག་རྟེན་འདིར་ཡང་ཤི་ནས་ནི།
en: “ ‘There is no person who dies in this world,

source: །འཇིག་རྟེན་གཞན་དུ་འཕོ་ཞིང་འགྲོ་མེད་ཀྱང་།
en: Who departs and goes to another world.

source: །ལས་བྱས་རྣམས་ནི་ནམ་ཡང་མེད་མི་འགྱུར།
en: But the karma that has been created is not destroyed.

source: །འཁོར་བ་ན་ཡང་དཀར་གནག་འབྲས་བུ་སྨིན།
en: It will ripen as good and bad results within saṃsāra. {15}

source: །རྟག་པ་མ་ཡིན་ཆད་པར་མི་འགྱུར་ཏེ།
en: “ ‘It is neither eternal nor is it annihilated.

source: །ལས་བསགས་མེད་ཅིང་གནས་པ་དག་ཀྱང་མེད།
en: There is no accumulation or presence of karma,

source: །དེ་ཡང་བྱས་ནས་རེག་པར་མི་འགྱུར་མིན།
en: Yet if it has been created there is no way to avoid encountering it,

source: །གཞན་གྱིས་བྱས་པ་ཚོར་བར་འགྱུར་བའང་མེད།
en: While that which is created by others will not be experienced. {16}

source: །འཕོ་བ་མེད་ཅིང་ཕྱིར་ཡང་འོང་བ་མེད།
en: “ ‘There is no passing away or returning.

source: །ཐམས་ཅད་ཡོད་པའང་མ་ཡིན་མེད་པའང་མིན།
en: There is no existence of all things, yet neither are they nonexistent.

source: །འདི་ན་ལྟ་གནས་འཇུག་པ་དག་པ་མིན།
en: There is no pure engagement with the locus of a view.

source: །སེམས་ཅན་སྤྱོད་པ་རབ་ཞི་འཇུག་པ་མེད།
en: There is no conduct of beings and no engagement with peace. {17}

source: །བདེ་གཤེགས་སྤྱོད་ཡུལ་རྒྱལ་བའི་ཡོན་ཏན་ནི།
en: “ ‘The conduct of the sugatas, the qualities of the jinas,

source: །སྐྱེ་མེད་ཞི་བ་མཚན་མ་མེད་པའི་གནས།
en: Are birthlessness, peace, and the absence of attributes.

source: །སྟོབས་དང་གཟུངས་རྣམས་དང་ནི་སྟོབས་བཅུའི་སྟོབས། །འདི་ནི་སངས་རྒྱས་ཁྱུ་མཆོག་གྱུར་པའི་མཆོག །དཀར་པོའི་ཆོས་མཆོག་ཡོན་ཏན་བསགས་པ་སྟེ།
en: The supreme leaders, the buddhas, have these strengths and retentions, And the strength of the ten strengths. {18} “ ‘The supreme good qualities, the accumulation of qualities,

source: །ཡོན་ཏན་ཡེ་ཤེས་གཟུངས་དང་སྟོབས་རྣམས་དང་། །རྫུ་འཕྲུལ་རྣམ་པར་འཕྲུལ་པ་བྱ་བའི་མཆོག །མངོན་ཤེས་མཆོག་ལྔ་འཐོབ་པ་དམ་པའི་ཚུལ།
en: Are the supreme qualities, wisdom, retentions, strengths, The supreme manifestation of miraculous powers, And the attainment of the five supreme higher cognitions. {19}

source: །འདིར་ནི་རང་བཞིན་གང་ནའང་ཤེས་པ་མེད།
en: “ ‘There is no essence here to be known whatsoever.

source: །འགྲོ་དང་འཇུག་མེད་མཁས་པའི་ཆོས་ཀྱི་འགྲོས།
en: There is no coming, no going; that is the subtle mode of phenomena.

source: །ཆོས་ཀྱི་དབྱིངས་ནི་གར་ཡང་མི་འགྲོ་སྟེ།
en: The essence of phenomena has no movement whatsoever,

source: །དེ་འདྲའི་འགྲོ་བ་འགྲོ་མེད་ཆོས་ཀྱི་འགྲོས།
en: Thus the mode of phenomena is the mode of no movement. {20}

source: །དབྱངས་ཀྱི་ཚོགས་མེད་ངོ་བོ་ཉིད་ཀྱི་འགྲོས།
en: “ ‘The natural mode is not in the accumulation of words.

source: །འགྲོ་བའི་རང་བཞིན་གང་དུའང་མི་གནས་ཏེ།
en: This mode, this nature, does not dwell anywhere.

source: །མི་གནས་མི་རྟེན་རང་བཞིན་འཇུག་པ་ནི།
en: The natural mode is without dwelling, is nondependent.

source: །རྒྱལ་བའི་སྤྱོད་ཡུལ་རྡུལ་བྲལ་ཞི་བའི་གནས།
en: It is the level of peace, the stainless domain of the jinas. {21}

source: །ཞི་བ་རབ་ཞི་ཉེ་བར་ཞི་བའི་འགྲོས།
en: “ ‘It is the mode of peace, complete peace, total peace.

source: །འགྲོ་བ་དེ་ནི་གར་ཡང་མི་གནས་ཏེ།
en: That mode does not dwell anywhere.

source: །རྟག་ཏུ་དངོས་པོའི་རང་བཞིན་རྗེས་སུ་སོང་།
en: It always accompanies the nature of things.

source: །མཁས་ཤིང་མི་གཡོ་མཐོང་དཀའ་ཤིན་ཏུ་གནས།
en: It is subtle, difficult to see, and an unfluctuating state. {22}

source: །དེ་ནི་མི་གཡོ་བདག་ཉིད་གནས་པ་སྟེ།
en: “ ‘It does not fluctuate but continues to be itself.

source: །མི་གནས་མ་འོངས་རང་བཞིན་གནས་པ་ཡིན།
en: It is a continuing nature that neither stays nor comes.

source: །རང་བཞིན་གནས་པ་བཤད་པར་མི་ནུས་ཏེ།
en: This continuing nature cannot be described.

source: །དེ་ནི་སྟོང་པ་མི་གཡོ་ཆོས་ཀྱི་གནས།
en: It is the empty, unfluctuating continuity of phenomena. {23}

source: །དབྱངས་ཀྱིས་བཤད་ཀྱང་དབྱངས་ཀྱི་འཇུག་པ་མེད།
en: “ ‘It is taught in words but it is not the mode of words.

source: །དབྱངས་ཀྱི་རང་བཞིན་འཇུག་པ་ཆོས་ཀྱི་འགྲོས།
en: The mode of the nature of words is the mode of phenomena.

source: །དབྱངས་ཀྱི་ཚོགས་གནས་གང་ནའང་ཡོད་མ་ཡིན།
en: The aggregation of words has no location anywhere,

source: །དེ་ལྟར་རང་བཞིན་འཇུག་པ་ཆོས་ཀྱི་འགྲོས།
en: And that mode of its nature is the mode of phenomena. {24}

source: །འགྲོས་ཀྱི་སྒྲར་གསུངས་སེམས་ཅན་འགྲོ་བ་མེད།
en: “ ‘The words that describe the mode are not the mode of being.

source: །ཆོས་ཀྱི་རང་བཞིན་མཁས་དོན་འགྲོ་བ་སྟེ།
en: The nature of phenomena is a mode of subtle meaning.

source: །དབྱངས་ཀྱང་བརྗོད་དེ་སེམས་ཅན་འགྲོ་བ་མེད།
en: Though words are spoken, that is not the mode of being;

source: །དབྱངས་རྣམས་མི་རྙེད་སེམས་ཅན་འགྲོ་བ་མེད།
en: Words cannot be found and neither can the mode of being. {25}

source: །མཐའ་དང་མཐའ་མེད་མ་ཡིན་དབུས་འགྲོ་མེད།
en: “ ‘There is no endlessness, nor an end, nor a mode in between.

source: །ཡོད་མེད་མ་ཡིན་ཕྱོགས་སུ་འགྲོ་བ་མེད།
en: There is no existence nor nonexistence, nor a partial mode.

source: །རང་བཞིན་འགྲོ་བ་ཅི་འདྲ་ཤེས་པ་ནི།
en: The knowledge of that mode of nature

source: །རྒྱལ་བ་མཆོག་གི་བསྟན་པ་འདི་དག་མཉམ།
en: Is the same in the teachings of all the supreme jinas. {26}

source: །རྡུལ་བྲལ་རྣམ་པར་དག་པ་དོན་དམ་གནས།
en: “ ‘The stainless, pure, ultimate state—

source: །ཞི་ཞིང་རབ་ཞི་རྡུལ་མེད་རྡུལ་བྲལ་བ།
en: Peace, complete peace, without stain, free of stain—

source: །རྟོག་དང་རློམ་སེམས་མེད་པ་རབ་ཞི་གནས།
en: There are no concepts or pride in the state of peace

source: །རྒྱལ་བ་ཐུགས་རྗེའི་མཆོག་ལྡན་སྟོན་པར་མཛད།
en: That is taught by the Jina, the one with perfect compassion. {27}

source: །འདི་ལ་ཡི་གེ་སྤྱོད་པ་ཡོད་མ་ཡིན།
en: “ ‘In this there is no usage of letters.

source: །འགྲོ་བ་ཡངས་ཤིང་ཡངས་དོན་འགྲོ་བ་སྟེ།
en: It is a vast mode, a vast mode of meaning.

source: །སངས་རྒྱས་དག་གིས་བསྙེན་ཅིང་རྒྱལ་བས་བསྟོད།
en: The buddhas honor it; the jinas praise it.

source: །སྣང་བའི་ཆོས་ཀྱི་ཚུལ་ནི་འཇུག་པ་ཕྲ།
en: The appearance of the Dharma is a subtle mode. {28}

source: །དེ་ལ་གནས་ནས་བདེ་གཤེགས་མཚུངས་མེད་པ།
en: “ ‘The unequaled sugatas remain in that

source: །ཆོས་ཀྱི་གཏེར་ནི་རྡུལ་བྲལ་ཡངས་པ་དང་། །རིན་ཆེན་ཆོས་རྣམས་རྡུལ་བྲལ་དོན་དམ་སྟོང་།
en: Stainless, vast treasure of the Dharma. They teach the stainless, precious Dharma,

source: །ཞི་བའི་དོན་ལ་འཇུག་པ་སྟོན་པར་མཛད།
en: The ultimate truth of emptiness, the subtle mode of meaning.’ {29}

source: །རྐང་གཉིས་གཙོ་བོས་ཏིང་འཛིན་འདི་བཤད་པ། །རྒྱལ་པོ་བརྟེན་བྱིན་གྱིས་ནི་དེ་ཚེ་ཐོས།
en: “When King Dṛdhadatta heard That the supreme human was teaching this samādhi,

source: །དེ་ནི་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱད་ཅུ་དང་། །རྒྱལ་བ་སྙིང་རྗེ་ཅན་དྲུང་རྟག་ཏུ་འོངས།
en: He then came into the presence of the compassionate Jina Accompanied by eighty quintillion others. {30}

source: །རྒྱལ་བ་སྟོབས་ལྡན་གུས་པ་རབ་བསྐྱེད་དེ། །ཞབས་ལ་མི་ཡི་བདག་པོ་ཕྱག་འཚལ་ནས།
en: “The sovereign over men felt veneration for the Jina Who was endowed with the strengths, and bowed down to his feet.

source: །དེ་ཚེ་སྟོབས་བཅུ་ལྡན་པའི་སྤྱན་སྔར་འདུག །རབ་ཏུ་དགའ་ཞིང་སོར་བཅུ་ཐལ་མོ་སྦྱར།
en: While he stayed in front of the one with the ten strengths, Filled with joy, he placed his ten fingers together in homage. {31} “The Jina, who was perfect, with control over his senses,

source: །དེ་ཡི་སྤྱོད་པ་ཡོངས་སུ་དག་རིག་ནས། །དབང་པོ་དག་ལ་དབང་གི་ཕ་རོལ་ཕྱིན།
en: Perceived the king’s pure conduct.

source: །མི་མཆོག་རྒྱལ་བ་མོས་པ་མཁྱེན་པ་ཡིས།
en: The supreme human knew his aspiration

source: །དེ་ལ་ཏིང་འཛིན་དམ་པ་འདི་བཤད་དོ།
en: And taught him this supreme samādhi. {32}

source: །རྒྱལ་པོ་དེ་ནི་དོན་དམ་འདི་ཐོས་ཚེ།
en: “When the king had heard this ultimate truth

source: །འཕགས་པའི་དགའ་བ་མཚུངས་མེད་སྐྱེས་ནས་སུ།
en: He experienced a vast, superior joy.

source: །གླིང་བཞི་དག་ཀྱང་ཐམས་ཅད་རྣམས་སྤངས་ཏེ།
en: He gave up all of the four continents.

source: །འདོད་པ་བོར་ནས་ཁྱིམ་ནས་མངོན་པར་བྱུང་།
en: He abandoned pleasures and left his home. {33} “When the king gave up the world and entered homelessness

source: །རྒྱལ་བར་འགྱུར་ཞེས་བྱང་ཆུབ་དོན་དུ་ཡང་། །ནམ་ཚེ་རྒྱལ་པོས་ས་བོར་རབ་བྱུང་ཚེ།
en: For the sake of enlightenment and to become a jina,

source: །འཛམ་བུའི་རྒྱལ་མཚན་འདི་ཡི་མི་ཀུན་ཀྱང་།
en: All the people in this Jambudvīpa

source: །འདོད་པའི་ཡོན་ཏན་རྣམ་སྤངས་རབ་ཏུ་བྱུང་།
en: Gave up all sensory pleasures and entered homelessness too. {34}

source: །དེ་ཚེ་སྟོབས་བཅུའི་ཡོན་ཏན་རྒྱ་ཆེ་སྟེ།
en: “At that time there was a vast assembly with the ten strengths.

source: །བརྩོན་ཡིད་དགེ་སློང་མ་དང་དགེ་སློང་མང་།
en: There were many diligent bhikṣus and bhikṣuṇīs.

source: །དེ་ཚེ་མ་རྨོས་མ་བཏབ་རྩི་འཁྲུངས་ཏེ།
en: At that time, herbs grew without ploughing,

source: །ལྷ་རྣམས་ཀྱང་ནི་གཡོག་དང་བསྙེན་བཀུར་བྱེད།
en: And devas came to serve and attend to them. {35}

source: །ངུར་སྨྲིག་ཆོས་གོས་གསུམ་དག་བྱུང་བར་གྱུར།
en: “The three orange Dharma robes manifested,

source: །དྲ་བ་མཉམ་ཞིང་དྲུབ་ལེགས་དཔེ་མེད་ལ།
en: Perfectly cut and sewn, without parallel,

source: །དྲི་མ་མེད་ཅིང་རྡུལ་བྲལ་གསེར་བརྒྱན་པ།
en: Unsullied, stainless, adorned, beautifully golden,

source: །སངས་རྒྱས་ཡོན་ཏན་བསོད་ནམས་སྟོབས་ལས་བྱུང་།
en: Arising from the Buddha’s qualities and the power of merit. {36}

source: །གཞོན་ནུ་ལྟོས་ཤིག་རྒྱལ་མཆོག་དེ་ཡང་ནི།
en: “See, young man, look how that supreme king

source: །ས་རྣམས་ཐམས་ཅད་རྣམ་སྤངས་རབ་བྱུང་ན།
en: Gave up the entire world and entered homelessness.

source: །ཟད་པའི་དུས་ན་སེམས་ཅན་མང་པོ་དག །ཤིན་ཏུ་ལོངས་སྤྱོད་ཆུང་ཡང་ཁྱིམ་མི་གཏོང་།
en: In the age of destruction there will be many beings Who will have few possessions but will not leave their homes. {37}

source: །ཤིང་སྒྲོག་དང་ནི་བཅིང་བ་ཆད་པ་མང་།
en: “There will be many in chains and suffering punishments,

source: །གཤེ་ཞིང་སྤྱོ་བ་སྡུག་བསྔལ་མི་དགའ་དང་། །བླ་མ་ཡི་ཆད་པ་མང་པོ་བཟོད་པར་བྱེད།
en: Who are abused, threatened, and have unwished-for suffering. There will be many who will have to endure harm from royal families,

source: །ལོངས་སྤྱོད་ཆུང་རབ་ཁྱིམ་ན་བཟའ་བ་མེད།
en: Who will have very few possessions and no food in their homes. {38}

source: །ཤིན་ཏུ་ཚེ་ཡང་ཐུང་ལ་ནོར་ཡང་མེད།
en: “They will have very short lives and no wealth.

source: །རབ་ཏུ་བག་ཆུང་བསོད་ནམས་སྟོབས་ཀྱང་མེད།
en: They will be very careless and have no power of merit.

source: །མི་མཁས་བཟོ་ཡི་གནས་ཀྱང་མི་ཤེས་ཏེ།
en: They will be stupid, and unskilled in any craft.

source: །དབུལ་པོར་གྱུར་ཅིང་ཁྱིམ་ན་ནོར་ཡང་མེད།
en: They will be in poverty with nothing in their homes. {39}

source: །དྲི་མ་མ་དག་གཞན་གྱི་བུད་མེད་ཆགས།
en: “They will be impure and desire the wives of others.

source: །ཕྲག་དོག་བྱེད་ཅིང་ཤིན་ཏུ་བཙམ་པ་མེད།
en: They will be envious and extremely rash.

source: །ཉོན་མོངས་ཆོས་ལྡན་ཚུལ་ལ་མི་གནས་ཀྱང་།
en: They will be degenerate and behave badly—

source: །ངེད་ནི་སངས་རྒྱས་ཉིད་དུ་འགྱུར་ཞེས་སྨྲ།
en: Yet they will say, ‘I am going to be a buddha.’ {40}

source: །གསུག་གིས་སླུ་ཞིང་བབ་ཆོལ་བྱེད་པ་དག །ང་ནི་ཕྱུག་པོ་འཇིག་རྟེན་ཆོས་ནོར་སྦྱིན།
en: “They will make deceptive promises and be brazen, saying, ‘I am wealthy and I will give the wealth of the Dharma to the world.’

source: །གནོད་པ་བྱེད་ཅིང་ཚུལ་འཆོས་སྒྱུ་མ་དག །ངེད་ནི་སངས་རྒྱས་ཉིད་དུ་འགྱུར་ཞེས་སྨྲ།
en: They will cause harm, be hypocritical and dishonest— Yet they will say, ‘I am going to be a buddha.’ {41}

source: །གཞན་དག་བསད་ཅིང་བཅིང་དང་གཙེ་ལ་དགའ།
en: “They will delight in killing, binding, and attacking others;

source: །ཚུལ་ཁྲིམས་འཆལ་པ་མ་རུངས་ཞེ་སྡང་ཡིད།
en: They will have bad conduct, and be cruel and aggressive.

source: །བྱས་པ་མི་གཟོ་དབྱེན་བྱེད་འཚེ་བར་གནས།
en: They will have no gratitude, be divisive and violent—

source: །བཙུན་པ་བྱང་ཆུབ་སྤྱོད་པ་སྟོན་ཅེས་སྨྲས།
en: Yet will say, ‘I am a noble practitioner of bodhisattva conduct.’ {42}

source: །གང་ལས་དེས་ནི་བྱང་ཆུབ་སྤྱོད་ཐོས་པ། །དེ་ཉིད་ལ་ནི་ཁོང་ཁྲོ་རབ་བསྐྱེད་ནས།
en: “They will become angry with anyone Who they hear teaching bodhisattva conduct.

source: །མཁས་པས་འཁྲུལ་པའི་ཚིག་འགའ་ཐོས་ན་ཡང་།
en: When they hear something that is stupid and mistaken

source: །དེ་ལ་མི་སྙན་བརྒྱ་དག་སྒྲོག་པར་བྱེད།
en: They will repeat those blameworthy words a hundred times. {43}

source: །གཞོན་ནུ་ང་ཡི་ཚིག་འདི་ཐོས་ནས་ནི།
en: “Young man, having heard these words of mine,

source: །དེ་དག་དང་ནི་སྟེན་པར་མ་བྱེད་ཅིག །བྱང་ཆུབ་དམ་པ་རེག་པར་འདོད་ན་ནི།
en: Do not follow those others. If you wish to reach the highest enlightenment

source: །རྨི་ལམ་དུ་ཡང་དེ་ལ་ཡིད་མ་རྟོན། །སྦྱངས་ཚུལ་བསྙུངས་པ་ཡོན་ཏན་དུ་མ་རྗོད།
en: They are not to be trusted, even in a dream. {44}

source: །ཡོན་ཏན་བསྐལ་པ་མང་པོ་བརྒྱར་བཤད་ཀྱང་།
en: “One could recount for hundreds of eons the many qualities Ascribed to the austere disciplines of mendicancy,

source: །དེ་ཡི་ཡོན་ཏན་དག་ལ་མི་གནས་ན།
en: But without possessing those qualities

source: །བྱང་ཆུབ་ཞི་བ་མཆོག་ནི་རྟོགས་མི་འགྱུར།
en: One will not attain the peace of the highest enlightenment. {45}

source: །ཁོར་མོར་ཡང་ནི་དགེ་ཞིང་འཇམ་པར་གྱིས།
en: “Always be good and gentle.

source: །ཚུལ་ཁྲིམས་དག་ཅིང་རྟག་ཏུ་དང་བའི་ཡིད།
en: Always have pure conduct and a serene mind.

source: །ཁོར་མོར་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པར་གྱིས།
en: Continually maintain pure conduct,

source: །རིང་པོར་མི་ཐོགས་ཏིང་འཛིན་མཆོག་ཐོབ་འགྱུར།
en: And before long you will attain the supreme samādhi. {46}

source: །ང་རྒྱལ་མ་བྱེད་ཐ་བ་མ་སྐྱེད་པར།
en: “Do not be proud and do not be harsh.

source: །རྟག་ཏུ་ཡིད་ནི་ཡོངས་སུ་དག་པར་གྱིས།
en: Always have a mind that is serene.

source: །ང་རྒྱལ་རྒྱགས་དང་འཆབ་པ་ཀུན་སྤོངས་ལ།
en: Eliminate all pride, arrogance, and hiding of your faults,

source: །ཏིང་འཛིན་མཆོག་འདི་རབ་ཏུ་ཐོབ་པར་གྱིས།
en: And attain this supreme samādhi. {47}

source: །རྟག་ཏུ་ཡོན་ཏན་ལས་ནི་རྒྱལ་བ་དྲན།
en: “Always remember the Jina’s qualities.

source: །གསེར་མཆོག་མདོག་འདྲ་ཤིན་ཏུ་འོད་མཛད་པ།
en: The color of perfect gold, shining brightly,

source: །མཚན་མོ་གནམ་ལ་སྐར་མས་གང་བ་ལྟར།
en: Like the sky at night filled with stars:

source: །ཐུབ་པའི་སྐུ་ནི་མཚན་གྱིས་ཡོངས་སུ་རྒྱས།
en: The Sage’s body is filled with signs. {48} “The descendant of Manu who remembers the moon of the Sage

source: །འཆག་ཅིང་འདུག་དང་འགྲེང་ཞིང་ཉལ་བ་ན། །མི་གང་ཐུབ་པའི་ཟླ་བ་དྲན་བྱེད་པ།
en: While walking, sitting, standing, or lying down

source: །དེ་ཡི་མདུན་ན་རྟག་ཏུ་སྟོན་པ་བཞུགས།
en: Will always have the Teacher present before him,

source: །དེ་ནི་རྒྱ་ཆེར་མྱ་ངན་འདས་པར་འགྱུར།
en: And he will have vast happiness. {i}

source: །གདུགས་དང་རྒྱལ་མཚན་བླ་རེ་བ་དན་མཆོག །ཕྱེ་མ་བྱུག་པ་མང་པོ་ཀུན་ཐོགས་ལ།
en: “Holding many powders and ointments, And excellent parasols, banners, canopies, and flags,

source: །རྟག་ཏུ་བདེ་བར་གཤེགས་ལ་མཆོད་པ་གྱིས།
en: Always make offerings to the Sugata

source: །རིང་པོར་མི་ཐོགས་ཏིང་འཛིན་མཆོག་འདི་འཐོབ།
en: And this supreme samādhi will soon be attained. {49}

source: །སྤོས་མཆོག་ཕྲེང་བ་མེ་ཏོག་བདུག་པ་དང་། །རོལ་མོ་སིལ་སྙན་མང་པོ་རབ་ཐོགས་ལ།
en: “Holding many musical instruments And excellent, exquisite incense, garlands, and flowers,

source: །རྒྱལ་བའི་མཆོད་རྟེན་དག་ལ་མཆོད་པ་གྱིས།
en: Make offerings always to the Jina’s stūpas

source: །རིང་པོར་མི་ཐོགས་ཏིང་འཛིན་མཆོག་འདི་ཐོབ།
en: And this supreme samādhi will soon be attained. {50}

source: །གླུ་གར་བཟང་པོ་སྣ་ཚོགས་མང་པོ་དང་། །ཡིད་གཙང་བཞད་གད་རོལ་མོ་བཟང་པོ་དང་། །རྟག་པར་མར་མེའི་ཕྲེང་སྡུག་བཟང་པོ་ཡིས།
en: “With many kinds of excellent songs and dance, With amusements and performances made with a pure mind, With excellent lights and incense,

source: །མཚུངས་པ་མེད་ལ་མཆོད་བཟང་རབ་ཏུ་གྱིས།
en: Always make excellent offerings to the unequaled one. {i}

source: །འཁར་རྔ་དང་ནི་སྒྲ་སྙན་རྫ་རྔ་བརྒྱ།
en: “With hundreds of paṇava drums and loud mṛdaṅga drums,
